alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n"That depends a good deal on where you want to get to," said the Cat.\n"I don\'t much care where ——" said Alice.\n"Then it doesn\'t matter which way you go," said the Cat.\n"—— so long as I get somewhere," Alice added as an explanation.\n"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

# task 01, 02 == використовуючи знак зворотнього слешу '\' - зекранували три одинарні кавички в тексті змінної 'alice_in_wonderland'
print('Task 01-03')
print(alice_in_wonderland) # task 03 == вивели на друк




"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea_area = 436402 # площа Чорного моря
azov_sea_area = 37800 # площа Азовського моря
all_sea_area = black_sea_area + azov_sea_area # площа Чорного та Азовського морів разом
print('Task 04')
print(f'Разом Чорне та Азовське моря займають {all_sea_area} км2.')


# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""

total_goods = 375291
goods_storages_1_and_2 = 250449
goods_storages_2_and_3 = 222950
# кількість товару на третьому складі
storage_third = total_goods - goods_storages_1_and_2
# кількість товару на другому складі
storage_second = goods_storages_2_and_3 - storage_third
# кількість товару на першому складі
storage_one = goods_storages_1_and_2 - storage_second
print('Task 05')
print(f'''На першому складі знаходиться: {storage_one} товарів.
На другому складі знаходиться: {storage_second} товарів.
На третьому складі знаходиться: {storage_third} товарів.
Всього товарів на трьох складах: {storage_one + storage_second + storage_third}''')

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""

part_payments = 18 # півтора року - це 18 місяців
every_month = 1179 # оплата кожного місяця
computer_cost = part_payments * every_month # загальна вартість
print('Task 06')
print(f'Вартість комп’ютера: {computer_cost} грн.')

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
# Створюємо змінні, для знаходження "залишку від ділення" використовуємо спец. символ %
a = 8019 % 8
b = 9907 % 9
c = 2789 % 5
d = 7248 % 6
e = 7128 % 5
f = 19224 % 9
# Виведення залишку від ділення чисел
print('Task 07')
print(f'''Залишок від ділення чисел:
a) 8019 : 8 = {a}    
b) 9907 : 9 = {b}    
c) 2789 : 5 = {c}    
d) 7248 : 6 = {d}
e) 7128 : 5 = {e}
f) 19224 : 9 = {f} ''')


# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
# В значенях змінних перемножуємо кількість кожного товару на ціну
total_big_pizza = 4 * 274
total_medium_pizza = 2 * 218
total_juice = 4 * 35
total_cake = 1 * 350
total_water = 3 * 21
total_sum = total_big_pizza + total_medium_pizza + total_juice + total_cake + total_water
# Виведення загальної суми
print('Task 08')
print(f'Загальна сума замовлення Ірини становить : {total_sum} грн.')


# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
all_photos = 232
one_album_page = 8
# для визначення кіль-ті сторінок альбома використовуємо матем. операцію "ділення"
total_album_pages = all_photos / one_album_page
# Виведення загальної кількості сторінок
print('Task 09')
print(f'Всього знадобиться {total_album_pages} сторінок в альбомі, щоб вклеїти всі {all_photos} фото.')


# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""

distance = 1600
one_hundred_km = 100
liters_one_hundred_km = 9
full_tank = 48
# Вираховуємо загальну кіл-ть літрів на подоріж
total_liters = (distance / one_hundred_km) * liters_one_hundred_km
# Вираховуємо загальну кіл-ть заправок за цю подоріж
total_full_tanks = total_liters / 48
# Виведення загальної кількості літрів і щонайменше кількості заправок
print('Task 10')
print(f'Для подорожі із Харкoва в Будапешт всього знадобиться {total_liters} літрів.')
print(f'Щонайменше {total_full_tanks} рази родині необхідно заїхати на заправку під час цієї подорожі.')
